# Terraform environment test
#### Format and Style 🖌`success`
#### Initialization ⚙️`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Truncated to 120000 bytes! See logoutput for complete plan]
Acquiring state lock. This may take a few moments...
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1mMDNmNzU3OS01ZjM5LTRkN2YtYmNlYS04ZTVjYjZkN2FjYTQ7b2JqZWN0SWQ9MDJiMTdkMjgtN2VjOC00MDg0LTkyY2UtZDI2MDUxZmE0OTk4O3N1YnNjcmlwdGlvbklkPTFjZThlOWFmLWMyZDYtNDRlNy05YzVlLTA5OWEzMDgwNTZmZTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
data.azurerm_monitor_data_collection_endpoint.k6tests: Reading...
data.azurerm_monitor_data_collection_rule.k6tests: Reading...
data.azurerm_kubernetes_cluster.k6tests: Reading...
data.azurerm_monitor_data_collection_endpoint.k6tests: Read complete after 1s [id=/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/MA_k6tests-amw-F7sT_norwayeast_managed/providers/Microsoft.Insights/dataCollectionEndpoints/k6tests-amw-F7sT]
data.azurerm_monitor_data_collection_rule.k6tests: Read complete after 1s [id=/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/k6tests-rg-F7sT/providers/Microsoft.Insights/dataCollectionRules/k6tests-dcr-F7sT]
data.azurerm_kubernetes_cluster.k6tests: Read complete after 3s [id=/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/k6tests-rg-F7sT/providers/Microsoft.ContainerService/managedClusters/k6tests-cluster-F7sT]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # module.services.helm_release.k6_operator will be updated in-place
  ~ resource "helm_release" "k6_operator" {
      ~ id                         = "k6-operator" -> (known after apply)
      ~ metadata                   = {
          ~ app_version    = "0.0.19" -> (known after apply)
          ~ chart          = "k6-operator" -> (known after apply)
          ~ first_deployed = 1744372041 -> (known after apply)
          ~ last_deployed  = 1750849967 -> (known after apply)
          ~ name           = "k6-operator" -> (known after apply)
          ~ namespace      = "k6-operator-system" -> (known after apply)
          ~ notes          = <<-EOT
                Thank you for installing k6-operator.
                
                Your release is named k6-operator.
                
                To learn more about the release, try:
                
                  $ helm status k6-operator
                  $ helm get all k6-operator
            EOT -> (known after apply)
          ~ revision       = 2 -> (known after apply)
          ~ values         = jsonencode(
                {
                  - installCRDs = true
                  - namespace   = {
                      - create = false
                    }
                  - prometheus  = {
                      - enabled = true
                    }
                }
            ) -> (known after apply)
          ~ version        = "3.11.1" -> (known after apply)
        } -> (known after apply)
        name                       = "k6-operator"
      ~ values                     = [
          ~ <<-EOT
                installCRDs: true
                
                namespace:
                  create: false
              - 
              - prometheus:
              -   enabled: true
            EOT,
        ]
      ~ version                    = "3.11.1" -> "3.13.1"
        # (26 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @monteiro-renato |
| Action | `pull_request` |
| Working Directory | `./infrastructure/adminservices-test/k6tests-rg` |
| State File | `github.com/altinn/altinn-platform/environments/test/k6tests-rg.tfstate` |
| Plan File | `github.com_altinn_altinn-platform_environments_test_k6tests-rg.tfstate.tfplan`